# start
start_menu = '🧬 Порівняння нуклеотидів' 
recent_result = '📉 Недавні результати'

text1 = '👋 Привіт, я бот *BLAST*\n'
text2 = '💻 Я вмію знаходити області подібності між біологічними послідовностями. Програма порівнює нуклеотидні або білкові послідовності з базами даних послідовностей і обчислює статистичну значущість.'

# founded_menu_faq
mess1 = "🔬*Blastn*\nПрограми шукають нуклеотидні бази даних за допомогою нуклеотидного запиту.\n\n"
mess2 = "🔬*Blastp*\nПрограми BLASTP виконують пошук в базах даних білків за допомогою запиту білків.\n\n"
mess3 = "🔬*Blastx*\nВиконує пошук в базах даних білків за допомогою трансльованого нуклеотидного запиту.\n\n"
mess4 = "🔬*Tblastn*\nВиконує пошук в базах даних транслюються нуклеотидів за допомогою білкового запиту.\n\n"
mess5 = "🔬*Tblastx*\nВиконує пошук трансльованих нуклеотидних баз даних за допомогою трансльованого нуклеотидного запиту.\n\n"
faq_error = '⚠️ Упс! Зачекайте закінчення пошуку.'
select_action = 'Виберіть дію'

#homo_sapiens_hucleotide
hseq = '\nПример *HSeq*:'
homo_sapiens = '📲 Введіть інвентарний *number(s)*, *gi(s)*, либо *FASTA sequence(s)*:'

#accession_number_blastn
accession_FASTA = '📲 Введіть діапазон запиту *Від*:'

#accession_number_blastn
qs_from = '📲 Введіть діапазон запиту *До*:'

#get_rid
get_rid = '⏳ Обробка даних'
get_rid_mess = '💬 Бот обчислює статистичну значущість, процес може зайняти деякий час.\n\n💡 Подивитися статус виконання можна перейшовши в розділ *Недавні результати*'
not_found = '⚠️ Немає результатів за заданим пошуку'

#get_result
get_result_not_found = '⚠️ Суттєвого подібності не виявлено'

#New_Title
result_search = 'Подивитися результат пошуку на сайті'

recent_not_found = '⚠️ Немає результатів пошуку'

request = 'Запит'
done = '*Готово*'
running = '*Незавершений*'